# Groupby

In [1]:
import numpy as np
import pandas as pd

In [6]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','ORACLE','TESLA','TESLA'],
       'Employee':['Sam','Russell','Steve','Peter','David','Elon'],
       'Sales':[200,300,100,300,500,400]}

In [7]:
data

{'Company': ['GOOGLE', 'GOOGLE', 'MSFT', 'ORACLE', 'TESLA', 'TESLA'],
 'Employee': ['Sam', 'Russell', 'Steve', 'Peter', 'David', 'Elon'],
 'Sales': [200, 300, 100, 300, 500, 400]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  Company Employee  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Russell    300
2    MSFT    Steve    100
3  ORACLE    Peter    300
4   TESLA    David    500
5   TESLA     Elon    400

In [10]:
byComp = df.groupby('Company')

In [11]:
byComp.mean()

         Sales
Company
GOOGLE   250.0
MSFT     100.0
ORACLE   300.0
TESLA    450.0

In [12]:
byComp.sum()

         Sales
Company
GOOGLE     500
MSFT       100
ORACLE     300
TESLA      900

In [13]:
df.groupby('Company').min()

        Employee  Sales
Company
GOOGLE   Russell    200
MSFT       Steve    100
ORACLE     Peter    300
TESLA      David    400

In [17]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
GOOGLE    2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
MSFT      1.0  100.0        NaN  100.0  100.0  100.0  100.0  100.0
ORACLE    1.0  300.0        NaN  300.0  300.0  300.0  300.0  300.0
TESLA     2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0